Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Constructor
Overload List
Name | Description
LayoutAttributes() |  Obsolete.
 Creates a new layout attributes instance that loads standard attributes.
LayoutAttributes(String) |  Obsolete.
 Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
LayoutAttributes(Drawing)
 Creates a new layout attributes instance that loads standard attributes.
LayoutAttributes(String, Drawing)
 Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
Top
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace